app/views/posts/_form.html.erb

SELECT "authors".* FROM "authors"
---
    <%= form.label :author %>
    <%= form.select :author_id, Author.all.collect { |a| [a.name, a.id] } %>