app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    # @post.author = Author.find(post_params[:author])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "image", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "image" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["image", "https://avatars.githubusercontent.com/u/94640715?v=4"], ["updated_at", "2022-01-16 00:43:20.061688"], ["id", 2]]